Revit 2026 API

# TemperatureRatingTypeCorrectionFactors Property

---

Get all correction factors defined in this temperature rating type and its corresponding material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CorrectionFactorSet CorrectionFactors { get; }
```
```vb
Public ReadOnly Property CorrectionFactors As CorrectionFactorSet
	Get
```
```cpp
public:
property CorrectionFactorSet^ CorrectionFactors {
	CorrectionFactorSet^ get ();
}
```
```fsharp
member CorrectionFactors : CorrectionFactorSet with get
```

#### Property Value

CorrectionFactorSet

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace